Pair Programming Limpieza I
En este ejercicio trabajaremos con un csv nuevo. En concreto trabajaremos con datos de banca/marketing. Este conjunto de datos contiene informaci√≥n sobre campa√±as de marketing bancario, incluyendo detalles como la edad, el trabajo, el estado civil, etc. En concreto estos datos son de una campa√±a de marketing para la venta de un producto o servicio, la columna ("y") parece indicar si el cliente ha aceptado la oferta o no.
Tenemos distintos tipos de variables en el dataset, veamos que significan:
Datos del cliente bancario:
age: (num√©rico)
job : tipo de trabajo (categ√≥rico: "administrativo", "obrero", "empresario", "empleada del hogar", "directivo", "jubilado", "aut√≥nomo", "servicios", "estudiante", "t√©cnico", "desempleado")
marital : estado civil (categ√≥rico: "divorciado", "casado", "soltero". Nota: "divorciado" significa divorciado o viudo)
education (categ√≥rica: "b√°sica.4a", "b√°sica.6a", "b√°sica.9a", "secundaria", "analfabeto", "curso.profesional", "t√≠tulo.universitario")
default: ¬øtiene cr√©dito en mora? (categ√≥rico: O: "no", 1: "s√≠")
housing: ¬øtiene pr√©stamo para vivienda? (categ√≥rico: 0: "no", 1: "s√≠")
loan: ¬øtiene pr√©stamo personal? (categ√≥rico: 0: "no", 1: "s√≠")
Datos relacionados con el √∫ltimo contacto de la campa√±a actual:
contact: tipo de comunicaci√≥n del contacto (categ√≥rico: "m√≥vil", "tel√©fono")
month_day_week: lista con el a√±o del √∫ltimo contacto (categ√≥rico: "ene", "feb", "mar", ..., "nov", "dic") y el d√≠a de la semana del √∫ltimo contacto (categorical: "mon", "tue", "wed", "thu", "fri")
duration: duraci√≥n del √∫ltimo contacto, en segundos (num√©rico). Nota importante: este atributo afecta en gran medida al objetivo de salida (por ejemplo, si duration=0 entonces y="no"). Sin embargo, la duraci√≥n no se conoce antes de realizar una llamada. Adem√°s, es obvio que y se conoce una vez finalizada la llamada. Por lo tanto, esta entrada s√≥lo deber√≠a incluirse a efectos de evaluaci√≥n comparativa y deber√≠a descartarse si la intenci√≥n es tener un modelo predictivo realista.
Otras variables:
campaign: n√∫mero de contactos realizados durante esta campa√±a y para este cliente (num√©rico, incluye el √∫ltimo contacto)
pdays: n√∫mero de d√≠as transcurridos desde que el cliente fue contactado por √∫ltima vez en una campa√±a anterior (num√©rico; 999 significa que el cliente no fue contactado previamente)
previous: n√∫mero de contactos realizados antes de esta campa√±a y para este cliente (num√©rico)
poutcome: resultado de la campa√±a de marketing anterior (categ√≥rico: "fracaso", "inexistente", "√©xito")
y: ¬øha suscrito el cliente un dep√≥sito a plazo? (binario: "s√≠", "no")
Variables de contexto social y econ√≥mico:
emp.var.rate: tasa de variaci√≥n del empleo - indicador trimestral (num√©rico)
cons.price.idx: √≠ndice de precios al consumidor - indicador mensual (num√©rico)
cons.conf.idx: √≠ndice de confianza del consumidor - indicador mensual (num√©rico)
euribor3`m: tipo euribor a 3 meses - indicador diario (num√©rico)
nr.employed: n√∫mero de empleados - indicador trimestral (num√©rico)
‚Äã
Hip√≥tesis
La edad, el trabajo, el estado civil, la educaci√≥n, la situaci√≥n de deuda y la forma de contacto pueden influir en la probabilidad de que un cliente acepte la oferta.
El n√∫mero de veces que se ha contactado a un cliente en el pasado (campo campaign), el n√∫mero de d√≠as que han pasado desde el √∫ltimo contacto (campo pdays), y el resultado de la campa√±a anterior (campo poutcome) pueden afectar la respuesta del cliente a una nueva oferta.
Las variables econ√≥micas (tales como el √≠ndice de precios al consumidor (cons.price.idx), la tasa de variaci√≥n del empleo (emp.var.rate), etc.) pueden influir en la probabilidad de que un cliente acepte la oferta.
Los clientes que ya tienen una hipoteca (housing) o un pr√©stamo (loan) pueden ser menos propensos a aceptar una nueva oferta, ya que podr√≠an estar limitados financieramente.
‚Äã
Entre las tareas que tendr√©is que hacer hoy:

    1. Explora el dataset con los m√©todos que hemos ido aprendiendo hasta ahora para familiarizarnos con los datos.

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("datos/bank-additional-full.csv", index_col = 0)

In [3]:
df.shape

(43170, 20)

In [4]:
df.head()

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y,month_day_week
0,56,housemaid,MARRIED,basic.4y,0.0,0.0,0.0,telephone,261,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857","5191,0",no,"['may', 'mon']"
1,57,services,MARRIED,high.school,NaN,0.0,0.0,telephone,149,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857","5191,0",no,"['may', 'mon']"
2,37,services,MARRIED,high.school,0.0,1.0,0.0,telephone,226,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857","5191,0",no,"['may', 'mon']"
3,40,admin.,MARRIED,basic.6y,0.0,0.0,0.0,telephone,151,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857","5191,0",no,"['may', 'mon']"
4,56,services,MARRIED,high.school,0.0,0.0,1.0,telephone,307,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857","5191,0",no,"['may', 'mon']"

In [5]:
df.isnull().sum() * 100/ df.shape[0]

age                0.000000
job                0.803799
marital            0.196896
education          4.204309
default           20.884874
housing            2.388233
loan               2.388233
contact            0.000000
duration           0.000000
campaign           0.000000
pdays              0.000000
previous           0.000000
poutcome           0.000000
emp.var.rate       0.000000
cons.price.idx     0.000000
cons.conf.idx      0.000000
euribor3m          0.000000
nr.employed        0.000000
y                  0.000000
month_day_week     0.000000
dtype: float64

In [6]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
age,43170.0,40.014918,10.407327,17.0,32.0,38.0,47.0,98.0
default,34154.0,0.000088,0.009372,0.0,0.0,0.0,0.0,1.0
housing,42139.0,0.535869,0.498718,0.0,0.0,1.0,1.0,1.0
loan,42139.0,0.155652,0.362529,0.0,0.0,0.0,0.0,1.0
duration,43170.0,257.883739,259.393738,0.0,102.0,179.0,319.0,4918.0
campaign,43170.0,2.564675,2.768538,1.0,1.0,2.0,3.0,56.0
pdays,43170.0,962.452282,186.962379,0.0,999.0,999.0,999.0,999.0
previous,43170.0,0.173639,0.496750,0.0,0.0,0.0,0.0,7.0
emp.var.rate,43170.0,0.078177,1.572217,-3.4,-1.8,1.1,1.4,1.4

    2. Cambia el nombre de las columnas para que no tengan puntos en el nombre. En concreto, reemplazad los "." por comas.

In [7]:
nuevas_columnas = {col : col.replace(".", ",") for col in df.columns}
df.rename(columns = nuevas_columnas, inplace= True)

In [8]:
df.head(1)

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,"emp,var,rate","cons,price,idx","cons,conf,idx",euribor3m,"nr,employed",y,month_day_week
0,56,housemaid,MARRIED,basic.4y,0.0,0.0,0.0,telephone,261,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857","5191,0",no,"['may', 'mon']"

    3. ¬øHay valores duplicados en nuestro dataframe? En caso de que los haya, elimin√°ndlos.

In [9]:
df.duplicated().sum()

1994

In [10]:
df.drop_duplicates(subset = df, inplace = True)

In [11]:
df.shape

(41176, 20)

In [12]:
df.head(1)

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,"emp,var,rate","cons,price,idx","cons,conf,idx",euribor3m,"nr,employed",y,month_day_week
0,56,housemaid,MARRIED,basic.4y,0.0,0.0,0.0,telephone,261,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857","5191,0",no,"['may', 'mon']"

    4. Como hemos visto, algunas columnas no tienen el tipo de datos que deber√≠an. Cambiad el tipo de dato para las columnas de cons.price.idx, cons.conf.idx, euribor3m, nr.employed.

In [13]:
df.dtypes

age                 int64
job                object
marital            object
education          object
default           float64
housing           float64
loan              float64
contact            object
duration            int64
campaign            int64
pdays               int64
previous            int64
poutcome           object
emp,var,rate      float64
cons,price,idx     object
cons,conf,idx      object
euribor3m          object
nr,employed        object
y                  object
month_day_week     object
dtype: object

In [14]:
df.head()

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,"emp,var,rate","cons,price,idx","cons,conf,idx",euribor3m,"nr,employed",y,month_day_week
0,56,housemaid,MARRIED,basic.4y,0.0,0.0,0.0,telephone,261,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857","5191,0",no,"['may', 'mon']"
1,57,services,MARRIED,high.school,NaN,0.0,0.0,telephone,149,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857","5191,0",no,"['may', 'mon']"
2,37,services,MARRIED,high.school,0.0,1.0,0.0,telephone,226,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857","5191,0",no,"['may', 'mon']"
3,40,admin.,MARRIED,basic.6y,0.0,0.0,0.0,telephone,151,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857","5191,0",no,"['may', 'mon']"
4,56,services,MARRIED,high.school,0.0,0.0,1.0,telephone,307,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857","5191,0",no,"['may', 'mon']"

In [15]:
import numpy as np

In [16]:
def cambiar_coma_punto(columna):
    try: 
        return float(columna.replace(",", "."))
    except:
        return np.nan

In [17]:
lista_columnas = ["cons,price,idx", "cons,conf,idx", "euribor3m", "nr,employed"]

In [18]:
for columna in lista_columnas:
    df[columna] = df[columna].apply(cambiar_coma_punto)

In [19]:
df.dtypes

age                 int64
job                object
marital            object
education          object
default           float64
housing           float64
loan              float64
contact            object
duration            int64
campaign            int64
pdays               int64
previous            int64
poutcome           object
emp,var,rate      float64
cons,price,idx    float64
cons,conf,idx     float64
euribor3m         float64
nr,employed       float64
y                  object
month_day_week     object
dtype: object

    5. En las columnas de marital y month, poner todos los valores en min√∫sculas.
    üí°Pista Podr√©is usar una funci√≥n o una lambda üí°

In [20]:
df.head()

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,"emp,var,rate","cons,price,idx","cons,conf,idx",euribor3m,"nr,employed",y,month_day_week
0,56,housemaid,MARRIED,basic.4y,0.0,0.0,0.0,telephone,261,1,999,0,NONEXISTENT,1.1,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']"
1,57,services,MARRIED,high.school,NaN,0.0,0.0,telephone,149,1,999,0,NONEXISTENT,1.1,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']"
2,37,services,MARRIED,high.school,0.0,1.0,0.0,telephone,226,1,999,0,NONEXISTENT,1.1,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']"
3,40,admin.,MARRIED,basic.6y,0.0,0.0,0.0,telephone,151,1,999,0,NONEXISTENT,1.1,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']"
4,56,services,MARRIED,high.school,0.0,0.0,1.0,telephone,307,1,999,0,NONEXISTENT,1.1,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']"

In [21]:
df.columns

Index(['age', 'job', 'marital', 'education', 'default', 'housing', 'loan',
       'contact', 'duration', 'campaign', 'pdays', 'previous', 'poutcome',
       'emp,var,rate', 'cons,price,idx', 'cons,conf,idx', 'euribor3m',
       'nr,employed', 'y', 'month_day_week'],
      dtype='object')

In [25]:
def cambiar_minuscula(string): 
    return string.lower()

'marital'

In [26]:
lista_col = ["marital", "poutcome" ]

In [27]:
for columna in lista_col:
    df[columna] = df[columna].apply(cambiar_minuscula)

AttributeError: 'float' object has no attribute 'lower'

In [ ]:
df.head()

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,"emp,var,rate","cons,price,idx","cons,conf,idx",euribor3m,"nr,employed",y,month_day_week
0,56,housemaid,NaN,basic.4y,0.0,0.0,0.0,telephone,261,1,999,0,NaN,1.1,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']"
1,57,services,NaN,high.school,NaN,0.0,0.0,telephone,149,1,999,0,NaN,1.1,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']"
2,37,services,NaN,high.school,0.0,1.0,0.0,telephone,226,1,999,0,NaN,1.1,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']"
3,40,admin.,NaN,basic.6y,0.0,0.0,0.0,telephone,151,1,999,0,NaN,1.1,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']"
4,56,services,NaN,high.school,0.0,0.0,1.0,telephone,307,1,999,0,NaN,1.1,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']"


    6. Para no olvidarnos de la visualizaci√≥n. A trav√©s de la visualizaci√≥n, podemos detectar errores, valores at√≠picos, valores faltantes y otros problemas comunes en los datos que de otra manera podr√≠an ser dif√≠ciles de identificar. Para esto vamos a hacer una serie de gr√°ficas que deber√°n ser incluidas en un subplot. Estas gr√°ficas tienen que ser:

        6.1. Una gr√°fica donde podamos ver si el tipo de trabajo afecta a que un cliente acepte la oferta.

        6.2. Una gr√°fica donde podamos ver si el hecho de que un cliente tenga una hipoteca afecta a que acepte la oferta.
        6.3 Una gr√°fica donde podamos ver si el hecho de que un cliente tenga un prestamo afecta a que acepte la oferta.
        6.4. Una gr√°fica donde podamos ver si hay una relaci√≥n entre el numero de d√≠as desde el √∫ltimo contacto afecta a que un cliente acepte la oferta
        6.5. Una gr√°fica donde podamos ver si hay relaci√≥n entre el resultado de la campa√±a anterior y si el cliente afecta a que el cliente acepte la oferta.
    7. Guardamos el csv para seguir trabajando en el siguiente ejercicio de pair de limpieza.